stressTest/jmeter/jmx/countBeanShellSimple.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.2.1">
	<hashTree>
		<TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="BeanShell tester" enabled="true">
			<boolProp name="TestPlan.functional_mode">false</boolProp>
			<boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
			<boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
			<elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
				<collectionProp name="Arguments.arguments"/>
			</elementProp>
		</TestPlan>
		<hashTree>
			<ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
				<stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
				<elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
					<boolProp name="LoopController.continue_forever">false</boolProp>
					<stringProp name="LoopController.loops">1</stringProp>
				</elementProp>
				<stringProp name="ThreadGroup.num_threads">3</stringProp>
				<stringProp name="ThreadGroup.ramp_time">1</stringProp>
				<boolProp name="ThreadGroup.scheduler">false</boolProp>
				<boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
			</ThreadGroup>
			<hashTree>
				<CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Counter" enabled="true">
					<stringProp name="CounterConfig.start">1</stringProp>
					<stringProp name="CounterConfig.end">1000</stringProp>
					<stringProp name="CounterConfig.incr">1</stringProp>
					<stringProp name="CounterConfig.name">COUNT</stringProp>
					<stringProp name="CounterConfig.format">0000</stringProp>
					<boolProp name="CounterConfig.per_user">false</boolProp>
				</CounterConfig>
				<hashTree/>
				<BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="BeanShell Sampler" enabled="true">
					<stringProp name="BeanShellSampler.query">var counter = vars.get(&quot;COUNT&quot;);
						var met = vars.get(&quot;method&quot;);
						System.out.println(counter);
						System.out.println(met);
						vars.put(&quot;output&quot;, counter);
					</stringProp>
					<boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
				</BeanShellSampler>
				<hashTree/>
				<CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
					<stringProp name="filename">./data/mixJRPC.csv</stringProp>
					<boolProp name="ignoreFirstLine">true</boolProp>
					<stringProp name="delimiter">\t</stringProp>
					<boolProp name="quotedData">false</boolProp>
					<boolProp name="recycle">true</boolProp>
					<boolProp name="stopThread">false</boolProp>
					<stringProp name="shareMode">shareMode.all</stringProp>
				</CSVDataSet>
				<hashTree/>
				<DebugSampler guiclass="TestBeanGUI" testclass="DebugSampler" testname="Debug Sampler" enabled="true">
					<boolProp name="displayJMeterProperties">false</boolProp>
					<boolProp name="displayJMeterVariables">true</boolProp>
					<boolProp name="displaySystemProperties">false</boolProp>
				</DebugSampler>
				<hashTree/>
				<ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
					<boolProp name="ResultCollector.error_logging">false</boolProp>
				</ResultCollector>
				<hashTree/>
			</hashTree>
		</hashTree>
	</hashTree>
</jmeterTestPlan>